duvallee/STM32F746Discovery/Src/usb/usbd_cdc_if.c
/**
  ******************************************************************************
  * @file           : usbd_cdc_if.c
  * @brief          :
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "main.h"
#include "stm32f7xx.h"
#include "stm32f7xx_hal.h"
#include "debug_output.h"

#include "cmsis_os.h"

#include "usbd_cdc_if.h"

/* Define size for the receive and transmit buffer over CDC */
/* It's up to user to redefine and/or remove those define */
#define APP_RX_DATA_SIZE                                 4
#define APP_TX_DATA_SIZE                                 4

/* Create buffer for reception and transmission           */
/* It's up to user to redefine and/or remove those define */
/* Received Data over USB are stored in this buffer       */
uint8_t UserRxBufferFS[APP_RX_DATA_SIZE];

/* Send Data over USB CDC are stored in this buffer       */
uint8_t UserTxBufferFS[APP_TX_DATA_SIZE];

extern USBD_HandleTypeDef hUsbDeviceFS;

/** @defgroup USBD_CDC_Private_FunctionPrototypes
  * @{
  */
static int8_t CDC_Init_FS(void);
static int8_t CDC_DeInit_FS(void);
static int8_t CDC_Control_FS(uint8_t cmd, uint8_t* pbuf, uint16_t length);
static int8_t CDC_Receive_FS(uint8_t* pbuf, uint32_t *Len);

USBD_CDC_ItfTypeDef USBD_Interface_fops_FS               =
{
   CDC_Init_FS,
   CDC_DeInit_FS,
   CDC_Control_FS,
   CDC_Receive_FS
};

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  CDC_Init_FS
  *         Initializes the CDC media low layer over the FS USB IP
  * @param  None
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
static int8_t CDC_Init_FS(void)
{ 
   /* Set Application Buffers */
   USBD_CDC_SetTxBuffer(&hUsbDeviceFS, UserTxBufferFS, 0);
   USBD_CDC_SetRxBuffer(&hUsbDeviceFS, UserRxBufferFS);
   return (USBD_OK);
   /* USER CODE END 3 */ 
}

/**
  * @brief  CDC_DeInit_FS
  *         DeInitializes the CDC media low layer
  * @param  None
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
static int8_t CDC_DeInit_FS(void)
{
   return (USBD_OK);
}

#if 1       // add by duvallee.lee, 2018-01-04
typedef struct
{
   uint32_t dwDTERate;
   uint8_t bCharFormat;
   uint8_t bParityType;
   uint8_t bDataBits;
} USBD_CDC_LineCodingDef;

USBD_CDC_LineCodingDef g_usbd_cdc_linecoding             =
{
   115200,                                                                       // baud reate
   0,                                                                            // 1 Stop bits
   0,                                                                            // None
   8                                                                             // Data 8 bits
};
#endif

/**
  * @brief  CDC_Control_FS
  *         Manage the CDC class requests
  * @param  cmd: Command code            
  * @param  pbuf: Buffer containing command data (request parameters)
  * @param  length: Number of data to be sent (in bytes)
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
static int8_t CDC_Control_FS(uint8_t cmd, uint8_t* pbuf, uint16_t length)
{ 
   switch (cmd)
   {
      case CDC_SEND_ENCAPSULATED_COMMAND :
         break;

      case CDC_GET_ENCAPSULATED_RESPONSE :
         break;

      case CDC_SET_COMM_FEATURE :
         break;

      case CDC_GET_COMM_FEATURE :
         break;

      case CDC_CLEAR_COMM_FEATURE :
         break;

      /*******************************************************************************/
      /* Line Coding Structure                                                       */
      /*-----------------------------------------------------------------------------*/
      /* Offset | Field       | Size | Value  | Description                          */
      /* 0      | dwDTERate   |   4  | Number |Data terminal rate, in bits per second*/
      /* 4      | bCharFormat |   1  | Number | Stop bits                            */
      /*                                        0 - 1 Stop bit                       */
      /*                                        1 - 1.5 Stop bits                    */
      /*                                        2 - 2 Stop bits                      */
      /* 5      | bParityType |  1   | Number | Parity                               */
      /*                                        0 - None                             */
      /*                                        1 - Odd                              */ 
      /*                                        2 - Even                             */
      /*                                        3 - Mark                             */
      /*                                        4 - Space                            */
      /* 6      | bDataBits  |   1   | Number Data bits (5, 6, 7, 8 or 16).          */
      /*******************************************************************************/
      case CDC_SET_LINE_CODING :
         g_usbd_cdc_linecoding.dwDTERate                 = *((uint32_t *) pbuf);
         g_usbd_cdc_linecoding.bCharFormat               = *(pbuf + 4);
         g_usbd_cdc_linecoding.bParityType               = *(pbuf + 5);
         g_usbd_cdc_linecoding.bDataBits                 = *(pbuf + 6);

         debug_output_dump("CDC_SET_LINE_CODING(%d) : [%02X] [%02X] [%02X] [%02X] [%02X] [%02X] [%02X] \r\n\r\n",
                                 length, *(pbuf + 0), *(pbuf + 1), *(pbuf + 2), *(pbuf + 3),
                                 *(pbuf + 4), *(pbuf + 5), *(pbuf + 6));
         debug_output_dump("==================================================== \r\n");

         break;

      case CDC_GET_LINE_CODING :
         *((uint32_t *) pbuf)                            = g_usbd_cdc_linecoding.dwDTERate;
         *(pbuf + 4)                                     = g_usbd_cdc_linecoding.bCharFormat;
         *(pbuf + 5)                                     = g_usbd_cdc_linecoding.bParityType;
         *(pbuf + 6)                                     = g_usbd_cdc_linecoding.bDataBits;

         debug_output_dump("==================================================== \r\n");
         debug_output_dump("CDC_GET_LINE_CODING(%d) : [%02X] [%02X] [%02X] [%02X] [%02X] [%02X] [%02X] \r\n\r\n",
                                 length, *(pbuf + 0), *(pbuf + 1), *(pbuf + 2), *(pbuf + 3),
                                 *(pbuf + 4), *(pbuf + 5), *(pbuf + 6));
         break;

      case CDC_SET_CONTROL_LINE_STATE :
         break;

      case CDC_SEND_BREAK :
         break;    

      default :
         break;
   }

   return (USBD_OK);
}

/**
  * @brief  CDC_Receive_FS
  *         Data received over USB OUT endpoint are sent over CDC interface 
  *         through this function.
  *           
  *         @note
  *         This function will block any OUT packet reception on USB endpoint 
  *         untill exiting this function. If you exit this function before transfer
  *         is complete on CDC interface (ie. using DMA controller) it will result 
  *         in receiving more data while previous ones are still not sent.
  *                 
  * @param  Buf: Buffer of data to be received
  * @param  Len: Number of data received (in bytes)
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
static int8_t CDC_Receive_FS(uint8_t* Buf, uint32_t *Len)
{
   USBD_CDC_SetRxBuffer(&hUsbDeviceFS, &Buf[0]);
   USBD_CDC_ReceivePacket(&hUsbDeviceFS);
   return (USBD_OK);
}

/**
  * @brief  CDC_Transmit_FS
  *         Data send over USB IN endpoint are sent over CDC interface 
  *         through this function.           
  *         @note
  *         
  *                 
  * @param  Buf: Buffer of data to be send
  * @param  Len: Number of data to be send (in bytes)
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL or USBD_BUSY
  */
uint8_t CDC_Transmit_FS(uint8_t* Buf, uint16_t Len)
{
   uint8_t result                                        = USBD_OK;
   USBD_CDC_HandleTypeDef *hcdc                          = (USBD_CDC_HandleTypeDef*) hUsbDeviceFS.pClassData;
   if (hcdc->TxState != 0)
   {
      return USBD_BUSY;
   }
   USBD_CDC_SetTxBuffer(&hUsbDeviceFS, Buf, Len);
   result                                                = USBD_CDC_TransmitPacket(&hUsbDeviceFS);
   return result;
}

#define CDC_LOG_BUFFER_SIZE                              512
static uint8_t g_cdc_log_buffer[CDC_LOG_BUFFER_SIZE];
static uint16_t g_cdc_log_buffer_index                   = 0;
static uint16_t g_cdc_log_buffer_data_length             = 0;

/* --------------------------------------------------------------------------
 * Name : CDC_Log_Write_Task()
 *
 *
 * -------------------------------------------------------------------------- */
void CDC_Log_Write_Task(void const * argument)
{
   while (1)
   {
      if (g_cdc_log_buffer_data_length > 0)
      {
         if (g_cdc_log_buffer_data_length > (CDC_LOG_BUFFER_SIZE - g_cdc_log_buffer_index))
         {
            CDC_Transmit_FS(&(g_cdc_log_buffer[g_cdc_log_buffer_index]), CDC_LOG_BUFFER_SIZE - g_cdc_log_buffer_data_length);
            CDC_Transmit_FS(&(g_cdc_log_buffer[0]), g_cdc_log_buffer_data_length - g_cdc_log_buffer_index);
         }
         else
         {
            CDC_Transmit_FS(&(g_cdc_log_buffer[0]), g_cdc_log_buffer_data_length);
         }
         g_cdc_log_buffer_index                          = 0;
         g_cdc_log_buffer_data_length                    = 0;
      }
      osDelay(10);
   }
}

/* --------------------------------------------------------------------------
 * Name : CDC_Log_Write()
 *
 *
 * -------------------------------------------------------------------------- */
void CDC_Log_Write(uint8_t ch)
{
   g_cdc_log_buffer[g_cdc_log_buffer_index]              = ch;
   g_cdc_log_buffer_index++;
   g_cdc_log_buffer_data_length++;
   g_cdc_log_buffer_index                                %= CDC_LOG_BUFFER_SIZE;
   if (g_cdc_log_buffer_data_length >= CDC_LOG_BUFFER_SIZE)
   {
      g_cdc_log_buffer_data_length                       = CDC_LOG_BUFFER_SIZE;
   }
}

